/*************************************************
Copyright (C), 2016-2026, TYUT JBD TEAM C.
File name: Racing_Track.c
Description: 存赛道图
Others: NONE
**************************************************/

#include "Ctrl.h"

//========== 预赛---串 ===========
Run_Track_Typedef Pre_Track_1 = 
{
    .Node_Num = 7,
    .Node_Mileage[0] =
    {
        {1400, 1000},
        {1400, 1000},
        {300, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000}
    },
    .Node_Turn_Dir[5] = {0},
    .Exception_Type[0] = {0, 3, 0, 2, 3, 0, 0},
};

//========== 预赛---并 ===========
Run_Track_Typedef Pre_Track_2 =
{
    .Node_Num = 7,
    .Node_Mileage[0] =
    {
        {1400, 1000},
        {1400, 1000},
        {300, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000}
    },
    .Node_Turn_Dir[5] = {0},
    .Exception_Type[0] = {0, 3, 0, 2, 3, 0, 0},
};

//========== 预赛---串 + 并 ===========
Run_Track_Typedef Pre_Track_3 = 
{
    .Node_Num = 7,
    .Node_Mileage[0] =
    {
        {1400, 1000},
        {1400, 1000},
        {300, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000}
    },
    .Node_Turn_Dir[5] = {0},
    .Exception_Type[0] = {0, 3, 0, 2, 3, 0, 0},
};

//========== 决赛---串 ===========
Run_Track_Typedef Final_Track_1 = 
{
    .Node_Num = 7,
    .Node_Mileage[0] =
    {
        {1400, 1000},
        {1400, 1000},
        {300, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000}
    },
    .Node_Turn_Dir[5] = {0},
    .Exception_Type[0] = {0, 3, 0, 2, 3, 0, 0},
};

//========== 决赛---并 ===========
Run_Track_Typedef Final_Track_2 = 
{
    .Node_Num = 7,
    .Node_Mileage[0] =
    {
        {1400, 1000},
        {1400, 1000},
        {300, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000}
    },
    .Node_Turn_Dir[5] = {0},
    .Exception_Type[0] = {0, 3, 0, 2, 3, 0, 0},
};

//========== 决赛---并 + 串 ===========
Run_Track_Typedef Final_Track_3 = 
{
    .Node_Num = 7,
    .Node_Mileage[0] =
    {
        {1400, 1000},
        {1400, 1000},
        {300, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000},
        {1400, 1000}
    },
    .Node_Turn_Dir[5] = {0},
    .Exception_Type[0] = {0, 3, 0, 2, 3, 0, 0},
};